#+TITLE: Emacs Dotfile
#+AUTHOR: Keane Yahn-Krafft


** DONE try out evil-org [1/1]
CLOSED: [2019-10-09 Wed 16:04]
- [X] use use-package
:LOGBOOK:
- Note taken on [2019-10-09 Wed 16:20] \\
  Example note.
- State "DONE"       from "TODO"       [2019-10-09 Wed 16:04]
CLOCK: [2019-10-09 Wed 14:36]--[2019-10-09 Wed 14:39] =>  0:03
:END:
[2019-10-09 Wed 14:36]
* Load =.custom.el=

So injected settings don't muck up our manually managed settings we
store them elsewhere

#+BEGIN_SRC emacs-lisp
  (setq-default custom-file "~/.emacs.d/custom.el")
  (when (file-exists-p custom-file)
      (load custom-file))
#+END_SRC

#+RESULTS:
: ~/.emacs.d/custom.el

